
. gen ecobuy = 0

. replace ecobuy = 1 if ecolbs > 0
(412 real changes made)

. tabulate ecobuy

     ecobuy |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        248       37.58       37.58
          1 |        412       62.42      100.00
------------+-----------------------------------
      Total |        660      100.00

. reg ecobuy ecoprc regprc faminc hhsize educ age

      Source |       SS           df       MS      Number of obs   =       660
-------------+----------------------------------   F(6, 653)       =     13.43
       Model |  17.0019785         6  2.83366308   Prob > F        =    0.0000
    Residual |  137.810143       653  .211041566   R-squared       =    0.1098
-------------+----------------------------------   Adj R-squared   =    0.1016
       Total |  154.812121       659  .234919759   Root MSE        =    .45939

------------------------------------------------------------------------------
      ecobuy | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      ecoprc |  -.8026219   .1094037    -7.34   0.000    -1.017447   -.5877963
      regprc |   .7192675    .131639     5.46   0.000     .4607808    .9777543
      faminc |   .0005518   .0005295     1.04   0.298     -.000488    .0015916
      hhsize |   .0238227   .0125262     1.90   0.058    -.0007739    .0484193
        educ |   .0247849   .0083743     2.96   0.003      .008341    .0412287
         age |  -.0005008   .0012499    -0.40   0.689    -.0029551    .0019536
       _cons |   .4236865   .1649674     2.57   0.010      .099756     .747617
------------------------------------------------------------------------------

. test faminc hhsize educ age

 ( 1)  faminc = 0
 ( 2)  hhsize = 0
 ( 3)  educ = 0
 ( 4)  age = 0

       F(  4,   653) =    4.43
            Prob > F =    0.0015

. gen lfaminc = ln(faminc)

. reg ecobuy ecoprc regprc lfaminc hhsize educ age

      Source |       SS           df       MS      Number of obs   =       660
-------------+----------------------------------   F(6, 653)       =     13.67
       Model |   17.278689         6   2.8797815   Prob > F        =    0.0000
    Residual |  137.533432       653  .210617813   R-squared       =    0.1116
-------------+----------------------------------   Adj R-squared   =    0.1034
       Total |  154.812121       659  .234919759   Root MSE        =    .45893

------------------------------------------------------------------------------
      ecobuy | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      ecoprc |  -.8006664   .1092981    -7.33   0.000    -1.015285   -.5860482
      regprc |    .721377   .1315196     5.48   0.000     .4631247    .9796294
     lfaminc |   .0445162   .0287239     1.55   0.122    -.0118861    .1009185
      hhsize |   .0227002    .012543     1.81   0.071    -.0019294    .0473297
        educ |    .023093   .0084508     2.73   0.006      .006499     .039687
         age |  -.0003865   .0012517    -0.31   0.758    -.0028444    .0020713
       _cons |   .3037519   .1789605     1.70   0.090    -.0476555    .6551593
------------------------------------------------------------------------------

. use "C:\Users\hxd220000\Desktop\Data Sets- STATA\EZANDERS.DTA" 

. regress luclms year feb mar apr may jun jul aug sep oct nov dec

      Source |       SS           df       MS      Number of obs   =       107
-------------+----------------------------------   F(12, 94)       =     14.36
       Model |  27.0363482        12  2.25302901   Prob > F        =    0.0000
    Residual |  14.7491008        94  .156905327   R-squared       =    0.6470
-------------+----------------------------------   Adj R-squared   =    0.6020
       Total |  41.7854489       106  .394202348   Root MSE        =    .39611

------------------------------------------------------------------------------
      luclms | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |  -.1665437   .0149503   -11.14   0.000    -.1962279   -.1368595
         feb |  -.0132261   .1867294    -0.07   0.944    -.3839816    .3575294
         mar |  -.0661643   .1867294    -0.35   0.724    -.4369198    .3045912
         apr |  -.3649279   .1867294    -1.95   0.054    -.7356834    .0058276
         may |  -.5147779   .1867294    -2.76   0.007    -.8855334   -.1440224
         jun |  -.5541234   .1867294    -2.97   0.004    -.9248789   -.1833679
         jul |  -.5191558   .1867294    -2.78   0.007    -.8899113   -.1484003
         aug |  -.3378477   .1867294    -1.81   0.074    -.7086032    .0329078
         sep |  -.7528584   .1867294    -4.03   0.000    -1.123614   -.3821029
         oct |  -.7867943   .1867294    -4.21   0.000     -1.15755   -.4160388
         nov |  -.6816665   .1867294    -3.65   0.000    -1.052422    -.310911
         dec |  -.3740492   .1926213    -1.94   0.055    -.7565034    .0084049
       _cons |   339.4264   29.66172    11.44   0.000     280.5323    398.3204
------------------------------------------------------------------------------
. test feb mar apr may jun jul aug sep oct nov dec

 ( 1)  feb = 0
 ( 2)  mar = 0
 ( 3)  apr = 0
 ( 4)  may = 0
 ( 5)  jun = 0
 ( 6)  jul = 0
 ( 7)  aug = 0
 ( 8)  sep = 0
 ( 9)  oct = 0
 (10)  nov = 0
 (11)  dec = 0

       F( 11,    94) =    4.32
            Prob > F =    0.0000
. regress luclms year feb mar apr may jun jul aug sep oct nov dec ez

      Source |       SS           df       MS      Number of obs   =       107
-------------+----------------------------------   F(13, 93)       =     15.76
       Model |  28.7422487        13  2.21094221   Prob > F        =    0.0000
    Residual |  13.0432002        93  .140249465   R-squared       =    0.6879
-------------+----------------------------------   Adj R-squared   =    0.6442
       Total |  41.7854489       106  .394202348   Root MSE        =     .3745

------------------------------------------------------------------------------
      luclms | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        year |  -.0811489   .0282722    -2.87   0.005    -.1372918    -.025006
         feb |  -.0132261   .1765405    -0.07   0.940    -.3638005    .3373484
         mar |  -.0661643   .1765405    -0.37   0.709    -.4167388    .2844101
         apr |  -.3649279   .1765405    -2.07   0.042    -.7155023   -.0143534
         may |  -.5147779   .1765405    -2.92   0.004    -.8653523   -.1642034
         jun |  -.5541234   .1765405    -3.14   0.002    -.9046978    -.203549
         jul |  -.5191558   .1765405    -2.94   0.004    -.8697303   -.1685814
         aug |  -.3378477   .1765405    -1.91   0.059    -.6884222    .0127267
         sep |  -.7528584   .1765405    -4.26   0.000    -1.103433   -.4022839
         oct |  -.7867943   .1765405    -4.46   0.000    -1.137369   -.4362198
         nov |  -.6816665   .1765405    -3.86   0.000    -1.032241   -.3310921
         dec |  -.3595756   .1821582    -1.97   0.051    -.7213057    .0021546
          ez |  -.5080266   .1456667    -3.49   0.001    -.7972917   -.2187614
       _cons |   170.2854   56.02201     3.04   0.003     59.03674     281.534
------------------------------------------------------------------------------
. use "C:\Users\hxd220000\Desktop\Data Sets- STATA\HSEINV.DTA" 

. tsset year

Time variable: year, 1947 to 1988
        Delta: 1 unit

. corr linvpc linvpc_1
(obs=41)

             |   linvpc linvpc_1
-------------+------------------
      linvpc |   1.0000
    linvpc_1 |   0.6391   1.0000
. corr lprice lprice_1
(obs=41)

             |   lprice lprice_1
-------------+------------------
      lprice |   1.0000
    lprice_1 |   0.9492   1.0000

. reg linvpc gprice t

      Source |       SS           df       MS      Number of obs   =        41
-------------+----------------------------------   F(2, 38)        =     19.77
       Model |  .575457228         2  .287728614   Prob > F        =    0.0000
    Residual |  .553167094        38  .014557029   R-squared       =    0.5099
-------------+----------------------------------   Adj R-squared   =    0.4841
       Total |  1.12862432        40  .028215608   Root MSE        =    .12065

------------------------------------------------------------------------------
      linvpc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      gprice |   3.878646   .9579971     4.05   0.000     1.939282     5.81801
           t |    .008037   .0015952     5.04   0.000     .0048077    .0112664
       _cons |  -.8532545    .040291   -21.18   0.000    -.9348193   -.7716897
------------------------------------------------------------------------------
. reg ginvpc gprice t

      Source |       SS           df       MS      Number of obs   =        41
-------------+----------------------------------   F(2, 38)        =      0.95
       Model |  .039000234         2  .019500117   Prob > F        =    0.3968
    Residual |  .782237921        38  .020585208   R-squared       =    0.0475
-------------+----------------------------------   Adj R-squared   =   -0.0026
       Total |  .821238155        40  .020530954   Root MSE        =    .14348

------------------------------------------------------------------------------
      ginvpc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      gprice |   1.566526   1.139214     1.38   0.177    -.7396933    3.872745
           t |    .000037    .001897     0.02   0.985    -.0038032    .0038772
       _cons |   .0059315   .0479125     0.12   0.902    -.0910623    .1029253
------------------------------------------------------------------------------
. reg return return_1 return_1_2

      Source |       SS           df       MS      Number of obs   =       689
-------------+----------------------------------   F(2, 686)       =      2.16
       Model |  19.2169743         2  9.60848717   Prob > F        =    0.1161
    Residual |  3051.20782       686   4.4478248   R-squared       =    0.0063
-------------+----------------------------------   Adj R-squared   =    0.0034
       Total |  3070.42479       688  4.46282673   Root MSE        =     2.109

------------------------------------------------------------------------------
      return | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    return_1 |   .0485723   .0387224     1.25   0.210    -.0274563    .1246009
  return_1_2 |   -.009735   .0070296    -1.38   0.167     -.023537     .004067
       _cons |   .2255486    .087234     2.59   0.010     .0542708    .3968263
------------------------------------------------------------------------------

. test return_1 return_1_2

 ( 1)  return_1 = 0
 ( 2)  return_1_2 = 0

       F(  2,   686) =    2.16
            Prob > F =    0.1161

. gen return_2 = return[_n-2]
(3 missing values generated)

. gen return_2_1 = return_1*return_2
(3 missing values generated)

. reg return return_1 return_2_1

      Source |       SS           df       MS      Number of obs   =       688
-------------+----------------------------------   F(2, 685)       =      1.80
       Model |  16.0639248         2  8.03196242   Prob > F        =    0.1658
    Residual |  3053.36998       685  4.45747442   R-squared       =    0.0052
-------------+----------------------------------   Adj R-squared   =    0.0023
       Total |   3069.4339       687   4.4678805   Root MSE        =    2.1113

------------------------------------------------------------------------------
      return | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    return_1 |   .0687116   .0392472     1.75   0.080    -.0083476    .1457709
  return_2_1 |   .0113384   .0100134     1.13   0.258    -.0083222     .030999
       _cons |   .1731605   .0809626     2.14   0.033     .0141959    .3321251
------------------------------------------------------------------------------

. test return_1 return_2_1

 ( 1)  return_1 = 0
 ( 2)  return_2_1 = 0

       F(  2,   685) =    1.80
            Prob > F =    0.1658


. use "C:\Users\hxd220000\Desktop\Data Sets- STATA\KIELMC.DTA" 

. reg lprice y81 ldist y81ldist

      Source |       SS           df       MS      Number of obs   =       321
-------------+----------------------------------   F(3, 317)       =     69.22
       Model |  24.3172548         3  8.10575159   Prob > F        =    0.0000
    Residual |  37.1217306       317  .117103251   R-squared       =    0.3958
-------------+----------------------------------   Adj R-squared   =    0.3901
       Total |  61.4389853       320  .191996829   Root MSE        =     .3422

------------------------------------------------------------------------------
      lprice | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         y81 |  -.0113101   .8050622    -0.01   0.989     -1.59525     1.57263
       ldist |    .316689   .0515323     6.15   0.000     .2153005    .4180775
    y81ldist |   .0481862   .0817929     0.59   0.556    -.1127394    .2091117
       _cons |   8.058468   .5084358    15.85   0.000     7.058133    9.058803
--------

. reg lprice y81 ldist y81ldist age agesq rooms baths lintst lland larea

      Source |       SS           df       MS      Number of obs   =       321
-------------+----------------------------------   F(10, 310)      =    114.55
       Model |   48.353762        10   4.8353762   Prob > F        =    0.0000
    Residual |  13.0852234       310  .042210398   R-squared       =    0.7870
-------------+----------------------------------   Adj R-squared   =    0.7802
       Total |  61.4389853       320  .191996829   Root MSE        =    .20545

------------------------------------------------------------------------------
      lprice | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         y81 |  -.2254466   .4946914    -0.46   0.649    -1.198824    .7479309
       ldist |   .0009226   .0446168     0.02   0.984    -.0868674    .0887125
    y81ldist |   .0624668   .0502788     1.24   0.215     -.036464    .1613976
         age |  -.0080075   .0014173    -5.65   0.000    -.0107962   -.0052187
       agesq |   .0000357   8.71e-06     4.10   0.000     .0000186    .0000528
       rooms |   .0461389   .0173442     2.66   0.008     .0120117    .0802662
       baths |   .1010478   .0278224     3.63   0.000     .0463032    .1557924
      lintst |  -.0599757   .0317217    -1.89   0.060    -.1223929    .0024414
       lland |   .0953425   .0247252     3.86   0.000      .046692     .143993
       larea |   .3507429   .0519485     6.75   0.000     .2485266    .4529592
       _cons |   7.673854   .5015718    15.30   0.000     6.686938    8.660769
------------------------------------------------------------------------------

. test age agesq rooms baths lintst lland larea

 ( 1)  age = 0
 ( 2)  agesq = 0
 ( 3)  rooms = 0
 ( 4)  baths = 0
 ( 5)  lintst = 0
 ( 6)  lland = 0
 ( 7)  larea = 0

       F(  7,   310) =   81.35
            Prob > F =    0.0000

. reg cinf unem

      Source |       SS           df       MS      Number of obs   =        55
-------------+----------------------------------   F(1, 53)        =      6.13
       Model |  32.6324798         1  32.6324798   Prob > F        =    0.0165
    Residual |  282.055894        53  5.32180932   R-squared       =    0.1037
-------------+----------------------------------   Adj R-squared   =    0.0868
       Total |  314.688374        54  5.82756247   Root MSE        =    2.3069

------------------------------------------------------------------------------
        dinf | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        unem |  -.5176487    .209045    -2.48   0.017    -.9369398   -.0983576
       _cons |   2.828202   1.224871     2.31   0.025     .3714212    5.284982
------------------------------------------------------------------------------

. reg unem unem_1

      Source |       SS           df       MS      Number of obs   =        55
-------------+----------------------------------   F(1, 53)        =     69.12
       Model |  68.9295284         1  68.9295284   Prob > F        =    0.0000
    Residual |  52.8515619        53   .99719928   R-squared       =    0.5660
-------------+----------------------------------   Adj R-squared   =    0.5578
       Total |   121.78109        54  2.25520538   Root MSE        =     .9986

------------------------------------------------------------------------------
        unem | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      unem_1 |   .7423824   .0892927     8.31   0.000     .5632839    .9214809
       _cons |   1.489685   .5202033     2.86   0.006      .446289     2.53308
------------------------------------------------------------------------------

. ivregress 2sls cinf (unem = unem_1)

Instrumental variables 2SLS regression            Number of obs   =         55
                                                  Wald chi2(1)    =       0.21
                                                  Prob > chi2     =     0.6430
                                                  R-squared       =     0.0457
                                                  Root MSE        =     2.3367

------------------------------------------------------------------------------
        cinf | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        unem |  -.1304462   .2814517    -0.46   0.643    -.6820813    .4211889
       _cons |   .6338199   1.625886     0.39   0.697    -2.552857    3.820497
------------------------------------------------------------------------------
Instrumented: unem
 Instruments: unem_1

